demystifying_processes_and_processors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-17 Sat 20:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Demystifying Processes and Processors</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Demystifying Processes and Processors</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5777465">1. Introduction</a></li>
<li><a href="#orgfb1eec4">2. Context/Assumptions</a></li>
<li><a href="#org2299101">3. A Process is Acted Upon</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5777465" class="outline-2">
<h2 id="org5777465"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Every so often I end up getting pulled into discussions related to
processes and processors which lead me to learn that many software
engineers seem to have a questionable handle on how those concepts
actually work. This has often been surprising for me but <span class="underline">in no way</span>
is meant to be condescending or anything along those lines since I
was personally driven by misconceptions for a long time but figured
that was largely due to my lack of formal education and therefore was
part of a minority among a mob that understood such inner workings.
</p>

<p>
Most often such discussions arise in the context of Kubernetes and
resource requests and limits. To be clear this is a topic that is not
only relatively nuanced but is also on top of many layers of
complicated systems so it's unreasonable to expect anyone to fit the
details of how it all fits together within their brain, but what seems
to be an inaccurate mental model of how things work and lack of
empircal approaches tend to lead people in questionable directions and
some of the resulting conversations have exposed areas where there
tend to be detours away from reality.
</p>
</div>
</div>

<div id="outline-container-orgfb1eec4" class="outline-2">
<h2 id="orgfb1eec4"><span class="section-number-2">2.</span> Context/Assumptions</h2>
<div class="outline-text-2" id="text-2">
<p>
First it is worth framing some of the assertions that will be
made. This will be written with the assumption that the system
involved is one which provides preemptive multitasking with a
scheduler which is furnished by a well designed delineation between
kernel-space and user-space which protects such preemption. I will be
drawing largely from some familiarity with how Linux handles this
concern and while I'm sure there are some variations on some other
platforms (particularly with different multitaking models) I <span class="underline">believe</span>
most tend to follow a similar model.
</p>
</div>
</div>

<div id="outline-container-org2299101" class="outline-2">
<h2 id="org2299101"><span class="section-number-2">3.</span> A Process is Acted Upon</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-06-17 Sat 20:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>